org/brain/config.org
#+title: emacs
#+author: j0lms
#+description: illiterate config file
#+startup: overview
#+options:toc:1

* toc :toc:
:PROPERTIES:
:ID:       63a096f5-3516-4d4a-85ee-b19565836012
:END:
- [[#preamble][preamble]]
- [[#elpaca][elpaca]]
- [[#personal][personal]]
- [[#packages][packages]]
  - [[#all-the-icons][all the icons]]
  - [[#nerd-icons][nerd icons]]
  - [[#which-key][which key]]
  - [[#toc][toc]]
  - [[#journal][journal]]
  - [[#bullets][bullets]]
  - [[#projectile][projectile]]
  - [[#perspective][perspective]]
  - [[#magit][magit]]
  - [[#treemacs][treemacs]]
  - [[#ligatures][ligatures]]
  - [[#pretty][pretty]]
  - [[#snippets][snippets]]
  - [[#company][company]]
  - [[#multiple-cursors][multiple cursors]]
  - [[#undo-tree][undo tree]]
  - [[#doom-modeline][doom modeline]]
  - [[#deft][deft]]
  - [[#emojify][emojify]]
  - [[#beacon][beacon]]
  - [[#hl-todo][hl todo]]
  - [[#diff-hl][diff hl]]
  - [[#flycheck][flycheck]]
  - [[#dashboard][dashboard]]
  - [[#ace-popup-menu][ace popup menu]]
  - [[#pulsar][pulsar]]
  - [[#elpy][elpy]]
  - [[#minimap][minimap]]
  - [[#unicode][unicode]]
  - [[#amx][amx]]
  - [[#ido-completing-read][ido completing read]]
  - [[#lsp][lsp]]
  - [[#elpher][elpher]]
  - [[#elfeed][elfeed]]
  - [[#solaire][solaire]]
  - [[#indent-guide][indent guide]]
  - [[#emamux][emamux]]
  - [[#pdf][pdf]]
  - [[#smartparens][smartparens]]
  - [[#modern][modern]]
  - [[#xonsh][xonsh]]
  - [[#brain][brain]]
  - [[#pyenv][pyenv]]
  - [[#eshell][eshell]]
  - [[#term][term]]
  - [[#workgroups][workgroups]]
  - [[#origami][origami]]
  - [[#hl-defined][hl defined]]
  - [[#elmacro][elmacro]]
  - [[#eros][eros]]
- [[#bindings][bindings]]
- [[#fonts][fonts]]
- [[#org][org]]
- [[#gui][gui]]
- [[#footer][footer]]

* preamble
:PROPERTIES:
:ID:       4788d5aa-0bd9-4072-a089-f3e5d0801410
:END:
#+begin_src emacs-lisp
  ;;; config.el --- Voidmacs config file

  ;;; Commentary:

  ;; This file is tangled from ~/.voi.d/org/brain/config.org

  ;;; Code:
#+end_src
* elpaca
:PROPERTIES:
:ID:       3f7ad895-e9c9-4828-ac91-8ff3f07e4098
:END:
#+begin_src emacs-lisp
  (defvar elpaca-installer-version 0.5)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
				:ref nil
				:files (:defaults (:exclude "extensions"))
				:build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
	 (build (expand-file-name "elpaca/" elpaca-builds-directory))
	 (order (cdr elpaca-order))
	 (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
	  (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
		   ((zerop (call-process "git" nil buffer t "clone"
					 (plist-get order :repo) repo)))
		   ((zerop (call-process "git" nil buffer t "checkout"
					 (or (plist-get order :ref) "--"))))
		   (emacs (concat invocation-directory invocation-name))
		   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
					 "--eval" "(byte-recompile-directory \".\" 0 'force)")))
		   ((require 'elpaca))
		   ((elpaca-generate-autoloads "elpaca" repo)))
	      (progn (message "%s" (buffer-string)) (kill-buffer buffer))
	    (error "%s" (with-current-buffer buffer (buffer-string))))
	((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  (elpaca elpaca-use-package
    (elpaca-use-package-mode)
    (setq elpaca-use-package-by-default t))

  (elpaca-wait)
#+end_src

#+RESULTS:

* personal
:PROPERTIES:
:ID:       f041b776-7d1d-428b-8f9f-98d31d5fce63
:END:
#+begin_src emacs-lisp -n
  (setq user-full-name "John Doe"
	user-mail-address "john@doe.com")
  ;;(setq warning-minimum-level :emergency)
  (setq server-client-instructions nil)
  (eval-and-compile
    (setq gc-cons-threshold 402653184
	  gc-cons-percentage 0.6))
  (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
  (setq inhibit-default-init t
	inhibit-startup-echo-area-message t
	inhibit-startup-screen t
	initial-scratch-message nil)
  (setq large-file-warning-threshold 100000000)
  (defconst gas-savefile-dir (expand-file-name "savefile" user-emacs-directory))
  (unless (file-exists-p gas-savefile-dir)
    (make-directory gas-savefile-dir))
  (blink-cursor-mode -1)
  (setq ido-enable-flex-matching t)
  (setq ido-everywhere t)
  (ido-mode 1)
  (setq ring-bell-function 'ignore)
  (setq scroll-margin 0
	scroll-conservatively 100000
	scroll-preserve-screen-position 1)
  (setq use-short-answers t)
  (setq confirm-nonexistent-file-or-buffer nil)
  (delete-selection-mode 1)
  (setq kill-buffer-query-functions
	(remq 'process-kill-buffer-query-function
	      kill-buffer-query-functions))
  (setq frame-title-format
	'((:eval (if (buffer-file-name)
		     (abbreviate-file-name (buffer-file-name))
		   "%b"))))
  (setq-default x-stretch-cursor t)
  (setq completion-auto-help nil)
  (setq backup-directory-alist
	`((".*" . ,temporary-file-directory)))
  (setq auto-save-file-name-transforms
	`((".*" ,temporary-file-directory t)))
  (let ((week (* 60 60 24 7))
	(current (float-time (current-time))))
    (dolist (file (directory-files temporary-file-directory t))
      (when (and (backup-file-name-p file)
		 (> (- current (float-time (nth 5 (file-attributes file))))
		    week))
	(message "%s" file)
	(delete-file file))))
  (global-auto-revert-mode t)
  (setq vc-make-backup-files t)
  (setq save-interprogram-paste-before-kill nil)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
  (set-language-environment "UTF-8")
  (prefer-coding-system 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-buffer-file-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (setq kill-whole-line t)
  (setq search-default-mode 'char-fold-to-regexp)
  (setq global-mark-ring-max 50000)
  (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
  (set 'linuxp (when (eq system-type 'gnu/linux) "yes"))
  (set 'windowp (when (eq system-type 'windows-nt) "yes"))
  (defun reload-init-file ()
    (interactive)
    (load-file user-init-file)
    (load-file user-init-file))

  (defun format-date (format)
    (let ((system-time-locale "es_VE.UTF-8"))
      (insert (format-time-string format))))

  (defun insert-deadline ()
    (interactive)
    (format-date "<%Y-%M-%d %A>"))

  (defun insert-schedule ()
    (interactive)
    (format-date "<%Y-%m-%d %H:%M>"))

  (defun insert-timestamp ()
    (interactive)
    (format-date "[%Y-%m-%d %A %H:%M:%S]"))
#+end_src

#+RESULTS:
: insert-timestamp

* packages 
:PROPERTIES:
:ID:       d6705198-cb2e-45a1-bbd7-7a3ed7a891e4
:END:
** all the icons
:PROPERTIES:
:ID:       f26f29bb-31c2-4d7b-b36d-7add424cce9a
:END:
#+begin_src emacs-lisp
  (use-package all-the-icons
    :init
    (all-the-icons-install-fonts t)
    :if (display-graphic-p))
#+end_src

#+RESULTS:

** nerd icons
:PROPERTIES:
:ID:       c4aa9e95-8a7f-4943-800f-ff9d53559130
:END:
#+begin_src emacs-lisp
    (use-package nerd-icons
      :init
      (nerd-icons-install-fonts t))
#+end_src

#+RESULTS:

** which key
:PROPERTIES:
:ID:       d234f50f-c1e1-4a86-ae87-7ea6e92a0d9a
:END:
#+begin_src emacs-lisp
  (use-package which-key
    :init
    (which-key-mode 1)
    :config
    (setq which-key-side-window-location 'bottom
	  which-key-sort-order #'which-key-key-order-alpha
	  which-key-sort-uppercase-first nil
	  which-key-add-column-padding 1
	  which-key-max-display-columns nil
	  which-key-min-display-lines 6
	  which-key-side-window-slot -10
	  which-key-side-window-max-height 0.25
	  which-key-idle-delay 0.5
	  which-key-max-description-length 25
	  which-key-allow-imprecise-window-fit t
	  which-key-separator " → " ))
#+end_src

#+RESULTS:

** toc
:PROPERTIES:
:ID:       da0c5bb2-1b33-4624-87b9-656d5906b4b3
:END:
#+begin_src emacs-lisp
  (use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

#+RESULTS:

** journal
:PROPERTIES:
:ID:       301dbaba-61ea-4345-86c9-e65837ce0301
:END:
#+begin_src emacs-lisp
  (use-package org-journal
    :bind
    ("C-c n j" . org-journal-new-entry)
    ("C-c n s" . org-journal-new-scheduled-entry)
    :init
    (setq org-journal-date-format "[%Y-%m-%d %A]"
	  org-journal-date-prefix "* Entries "
	  org-journal-file-format "%Y-%m-%d.org"
	  org-journal-dir "~/.voi.d/org/brain/journal"
	  org-journal-file-header "#+title: daily\n#+filetags: journal\n"
	  org-journal-time-format "[%Y-%m-%d %H:%M:%S] "
	  org-journal-enable-agenda-integration t))
#+end_src

#+RESULTS:

** bullets
:PROPERTIES:
:ID:       0309864b-d05a-42dc-9414-4e5517b6f5b1
:END:
#+begin_src emacs-lisp
  (use-package org-bullets
    :init
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+end_src

#+RESULTS:

** projectile
:PROPERTIES:
:ID:       93b43568-afd4-4f26-a0c7-99db11931f36
:END:
#+begin_src emacs-lisp
  (use-package projectile
    :init
    (projectile-mode 1))
#+end_src

#+RESULTS:

