org/brain/config.org
** perspective
:PROPERTIES:
:ID:       57ad712e-854c-44a7-8d34-c337aa962b84
:END:
#+begin_src emacs-lisp
  (use-package perspective
    :bind
    ("C-x C-b" . persp-list-buffers) 
    :custom
    (persp-mode-prefix-key (kbd "C-c M-p"))
    :init
    (persp-mode))
#+end_src

#+RESULTS:

** magit
:PROPERTIES:
:ID:       44d8ddff-ef93-42fc-a519-a59279ae6417
:END:
#+begin_src emacs-lisp
  (use-package magit
    :init
    (with-eval-after-load 'magit-mode
      (add-hook 'after-save-hook 'magit-after-save-refresh-status t)))
#+end_src

#+RESULTS:

** treemacs
:PROPERTIES:
:ID:       0c8102f7-b16f-4ae4-884a-a639bf932986
:END:
#+begin_src emacs-lisp
  (use-package treemacs
    :ensure t
    :defer t
    :init
    (with-eval-after-load 'winum
      (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
    :config
    (progn
      (setq treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
	    treemacs-deferred-git-apply-delay        0.5
	    treemacs-directory-name-transformer      #'identity
	    treemacs-display-in-side-window          t
	    treemacs-eldoc-display                   'simple
	    treemacs-file-event-delay                2000
	    treemacs-file-extension-regex            treemacs-last-period-regex-value
	    treemacs-file-follow-delay               0.2
	    treemacs-file-name-transformer           #'identity
	    treemacs-follow-after-init               t
	    treemacs-expand-after-init               t
	    treemacs-find-workspace-method           'find-for-file-or-pick-first
	    treemacs-git-command-pipe                ""
	    treemacs-goto-tag-strategy               'refetch-index
	    treemacs-header-scroll-indicators        '(nil . "^^^^^^")
	    treemacs-hide-dot-git-directory          t
	    treemacs-indentation                     2
	    treemacs-indentation-string              " "
	    treemacs-is-never-other-window           nil
	    treemacs-max-git-entries                 5000
	    treemacs-missing-project-action          'ask
	    treemacs-move-forward-on-expand          nil
	    treemacs-no-png-images                   nil
	    treemacs-no-delete-other-windows         t
	    treemacs-project-follow-cleanup          nil
	    treemacs-persist-file                    (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
	    treemacs-position                        'left
	    treemacs-read-string-input               'from-child-frame
	    treemacs-recenter-distance               0.1
	    treemacs-recenter-after-file-follow      nil
	    treemacs-recenter-after-tag-follow       nil
	    treemacs-recenter-after-project-jump     'always
	    treemacs-recenter-after-project-expand   'on-distance
	    treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
	    treemacs-project-follow-into-home        nil
	    treemacs-show-cursor                     nil
	    treemacs-show-hidden-files               t
	    treemacs-silent-filewatch                nil
	    treemacs-silent-refresh                  nil
	    treemacs-sorting                         'alphabetic-asc
	    treemacs-select-when-already-in-treemacs 'move-back
	    treemacs-space-between-root-nodes        t
	    treemacs-tag-follow-cleanup              t
	    treemacs-tag-follow-delay                1.5
	    treemacs-text-scale                      nil
	    treemacs-user-mode-line-format           nil
	    treemacs-user-header-line-format         nil
	    treemacs-wide-toggle-width               70
	    treemacs-width                           35
	    treemacs-width-increment                 1
	    treemacs-width-is-initially-locked       t
	    treemacs-workspace-switch-cleanup        nil)
    
      (treemacs-follow-mode t)
      (treemacs-filewatch-mode t)
      (treemacs-fringe-indicator-mode 'always)
      (when treemacs-python-executable
	(treemacs-git-commit-diff-mode t))

      (pcase (cons (not (null (executable-find "git")))
		   (not (null treemacs-python-executable)))
	(`(t . t)
	 (treemacs-git-mode 'deferred))
	(`(t . _)
	 (treemacs-git-mode 'simple)))

      (treemacs-hide-gitignored-files-mode nil))
    :bind
    (:map global-map
	  ("M-0"       . treemacs-select-window)
	  ("C-x t 1"   . treemacs-delete-other-windows)
	  ("C-x t t"   . treemacs)
	  ("C-x t d"   . treemacs-select-directory)
	  ("C-x t B"   . treemacs-bookmark)
	  ("C-x t C-t" . treemacs-find-file)
	  ("C-x t M-t" . treemacs-find-tag)))

  (use-package treemacs-projectile
    :after (treemacs projectile)
    :ensure t)

  (use-package treemacs-magit
    :after (treemacs magit)
    :ensure t)

  (use-package treemacs-nerd-icons
    :config
    (treemacs-load-theme "nerd-icons"))

  (use-package treemacs-persp
    :after (treemacs persp-mode)
    :ensure t
    :config (treemacs-set-scope-type 'Perspectives))

  (add-hook 'treemacs-mode-hook (lambda() (display-line-numbers-mode -1)))
#+end_src 

#+RESULTS:
| lambda | nil | (display-line-numbers-mode -1) |

** ligatures
:PROPERTIES: 
:ID:       f644db69-04cd-444f-96ff-e0eda5962f5e
:END:


#+begin_src emacs-lisp
  (use-package ligature
    :config
    (ligature-set-ligatures 't
			    '(;; == === ==== => =| =>>=>=|=>==>> ==< =/=//=// =~
			      ;; =:= =!=
			      ("=" (rx (+ (or ">" "<" "|" "/" "~" ":" "!" "="))))
			      ;; ;; ;;;
			      (";" (rx (+ ";")))
			      ;; && &&&
			      ("&" (rx (+ "&")))
			      ;; !! !!! !. !: !!. != !== !~
			      ("!" (rx (+ (or "=" "!" "\." ":" "~"))))
			      ;; ?? ??? ?:  ?=  ?.
			      ("?" (rx (or ":" "=" "\." (+ "?"))))
			      ;; %% %%%
			      ("%" (rx (+ "%")))
			      ;; |> ||> |||> ||||> |] |} || ||| |-> ||-||
			      ;; |->>-||-<<-| |- |== ||=||
			      ;; |==>>==<<==<=>==//==/=!==:===>
			      ("|" (rx (+ (or ">" "<" "|" "/" ":" "!" "}" "\]"
					      "-" "=" ))))
			      ;; \\ \\\ \/
			      ("\\" (rx (or "/" (+ "\\"))))
			      ;; ++ +++ ++++ +>
			      ("+" (rx (or ">" (+ "+"))))
			      ;; :: ::: :::: :> :< := :// ::=
			      (":" (rx (or ">" "<" "=" "//" ":=" (+ ":"))))
			      ;; // /// //// /\ /* /> /===:===!=//===>>==>==/
			      ("/" (rx (+ (or ">"  "<" "|" "/" "\\" "\*" ":" "!"
					      "="))))
			      ;; .. ... .... .= .- .? ..= ..<
			      ("\." (rx (or "=" "-" "\?" "\.=" "\.<" (+ "\."))))
			      ;; -- --- ---- -~ -> ->> -| -|->-->>->--<<-|
			      ("-" (rx (+ (or ">" "<" "|" "~" "-"))))
			      ;; *> */ *)  ** *** ****
			      ("*" (rx (or ">" "/" ")" (+ "*"))))
			      ;; www wwww
			      ("w" (rx (+ "w")))
			      ;; <> <!-- <|> <: <~ <~> <~~ <+ <* <$ </  <+> <*>
			      ;; <$> </> <|  <||  <||| <|||| <- <-| <-<<-|-> <->>
			      ;; <<-> <= <=> <<==<<==>=|=>==/==//=!==:=>
			      ;; << <<< <<<<
			      ("<" (rx (+ (or "\+" "\*" "\$" "<" ">" ":" "~"  "!"
					      "-"  "/" "|" "="))))
			      ;; >: >- >>- >--|-> >>-|-> >= >== >>== >=|=:=>>
			      ;; >> >>> >>>>
			      (">" (rx (+ (or ">" "<" "|" "/" ":" "=" "-"))))
			      ;; #: #= #! #( #? #[ #{ #_ #_( ## ### #####
			      ("#" (rx (or ":" "=" "!" "(" "\?" "\[" "{" "_(" "_"
					   (+ "#"))))
			      ;; ~~ ~~~ ~=  ~-  ~@ ~> ~~>
			      ("~" (rx (or ">" "=" "-" "@" "~>" (+ "~"))))
			      ;; __ ___ ____ _|_ __|____|_
			      ("_" (rx (+ (or "_" "|"))))
			      ;; Fira code: 0xFF 0x12
			      ("0" (rx (and "x" (+ (in "A-F" "a-f" "0-9")))))
			      ;; Fira code:
			      "Fl"  "Tl"  "fi"  "fj"  "fl"  "ft"
			      ;; The few not covered by the regexps.
			      "{|"  "[|"  "]#"  "(*"  "}#"  "$>"  "^="))
    (global-ligature-mode t))
#+end_src

#+RESULTS:

** pretty
:PROPERTIES:
:ID:       0cbdbf46-8628-4deb-844e-fd63997c10b7
:END:
#+begin_src emacs-lisp
  (use-package pretty-mode
    :init
    (global-pretty-mode t)  
    (add-hook 'my-pretty-language-hook 'turn-on-pretty-mode))
#+end_src

#+RESULTS:

** snippets
:PROPERTIES:
:ID:       7d2d35a0-5c12-47ad-922a-e81051fed46c
:END:
#+begin_src emacs-lisp
  (use-package yasnippet
    :init
    (yas-global-mode t))
  (use-package yasnippet-snippets)
#+end_src 

#+RESULTS:

** company
:PROPERTIES:
:ID:       b6bba2c5-6d05-4987-bb29-5c05c96d1f13
:END:
#+begin_src emacs-lisp 
  (use-package company
    :init
    (global-company-mode t))
#+end_src

#+RESULTS:

** multiple cursors
:PROPERTIES:
:ID:       a5f70eb6-2872-4562-8be2-2f384a5487f6
:END:
#+begin_src emacs-lisp 
  (use-package multiple-cursors
    :init
    (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
    (global-set-key (kbd "C->") 'mc/mark-next-like-this)
    (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
    (global-set-key (kbd "C-x C-<") 'mc/mark-all-like-this))
#+end_src

#+RESULTS:

