org/brain/config.org
** undo tree
:PROPERTIES:
:ID:       da5ad3fe-6d4d-4fbb-bf49-893c39fc7363
:END:
#+begin_src emacs-lisp
  (use-package undo-tree
    :init
    (global-undo-tree-mode))
  (with-eval-after-load 'undo-tree
    (setq undo-tree-auto-save-history nil))
#+end_src

#+RESULTS:

** doom modeline
:PROPERTIES:
:ID:       a7197c15-fc23-4bc4-9fdd-cb0b86e67600
:END:
#+begin_src emacs-lisp
  (use-package smart-mode-line-atom-one-dark-theme)
  (use-package smart-mode-line
    :init
    (setq sml/no-confirm-load-theme t)
    (setq sml/theme 'atom-one-dark)
    (sml/setup))
  (use-package doom-modeline
    :ensure t
    :init 
    (doom-modeline-mode 1))
#+end_src

#+RESULTS:

** deft
:PROPERTIES:
:ID:       cf0ec7b7-f369-4af8-b92e-4b30bc83bb05
:END:
#+begin_src emacs-lisp
  (use-package deft
    :bind ("<f8>" . deft)
    :commands (deft)
    :config (setq deft-directory "~/notes"
		  deft-extensions '("md" "org")
		  deft-recursive t
		  deft-use-filename-as-title t))
#+end_src

#+RESULTS:

** emojify
:PROPERTIES:
:ID:       d5e36405-e551-4aea-88ea-263156773cd0
:END:
#+begin_src emacs-lisp 
  (use-package emojify
    :hook (after-init . global-emojify-mode))
#+end_src

#+RESULTS:

** beacon
:PROPERTIES:
:ID:       fbe5f281-11c8-437f-a9cd-1a68972a2078
:END:
#+begin_src emacs-lisp
  (use-package beacon
    :init
    (beacon-mode 1))
#+end_src

#+RESULTS:

** hl todo
:PROPERTIES:
:ID:       ce78fb0e-034a-4121-bb44-475684a02bf2
:END:
#+begin_src emacs-lisp
  (use-package hl-todo
    :init
    (global-hl-todo-mode))
#+end_src

#+RESULTS:

** diff hl
:PROPERTIES:
:ID:       49575fc3-e518-4488-828c-5d1be7d2e74f
:END:
#+begin_src emacs-lisp
  (use-package diff-hl
    :ensure t
    :config
    (global-diff-hl-mode +1)
    (add-hook 'dired-mode-hook 'diff-hl-dired-mode)
    (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh))
#+end_src

#+RESULTS:

** flycheck
:PROPERTIES:
:ID:       03996339-e8a8-4bf4-a5b3-65bbacbb7148
:END:
#+begin_src emacs-lisp
  (use-package flycheck
    :ensure t
    :init (global-flycheck-mode))
#+end_src

#+RESULTS:

** TODO dashboard
:PROPERTIES:
:ID:       96bf361b-63b5-42b9-a1fc-aeba51218bd5
:END:
#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook)
    (global-set-key (kbd "C-c d") '(lambda () (interactive) (dashboard-open)))
    (setq dashboard-banner-logo-title "")
    (setq dashboard-center-content t)
    (setq dashboard-show-shortcuts nil)
    (setq dashboard-items '((recents  . 5)
			    (bookmarks . 5)
			    (projects . 5)
			    (agenda . 5)))
    (setq dashboard-display-icons-p t)
    (setq dashboard-icon-type 'nerd-icons)
    (setq dashboard-startup-banner '("~/.voi.d/banners/blackhole-lines.svg" . "~/.voi.d/banners/blackhole-lines.txt"))
    (setq dashboard-item-names '(("Recent Files:" . "  RECENT")
				 ("Bookmarks:" . "  BOOKMARKS")
				 ("Projects:" . "  PROJECTS")
				 ("Agenda for the coming week:" . "  AGENDA")))
    (setq dashboard-footer-messages '(
				      "voidmacs"
				      ))
    (setq dashboard-projects-switch-function 'projectile-persp-switch-project))
    ;; (setq dashboard-set-navigator t)
    ;; (setq dashboard-navigator-buttons
    ;; 	`(

    ;; 	  ((,(all-the-icons-octicon "mark-github" :height 1.1 :v-adjust 0.0)
    ;; 	    "Homepage"
    ;; 	    "Browse homepage"
    ;; 	    (lambda (&rest _) (browse-url "homepage")))
    ;; 	   ("★" "Star" "Show stars" (lambda (&rest _) (show-stars)) warning)
    ;; 	   ("?" "" "?/h" #'show-help nil "<" ">"))

    ;; 	  ((,(all-the-icons-faicon "linkedin" :height 1.1 :v-adjust 0.0)
    ;; 	    "Linkedin"
    ;; 	    ""
    ;; 	    (lambda (&rest _) (browse-url "homepage")))
    ;; 	   ("⚑" nil "Show flags" (lambda (&rest _) (message "flag")) error)))))
#+end_src

#+RESULTS:

** ace popup menu
:PROPERTIES:
:ID:       fa6cc2ac-69b5-4c9d-a59a-f19e61304d28
:END:
#+begin_src emacs-lisp
  (use-package ace-popup-menu
    :init
    (ace-popup-menu-mode 1))
#+end_src

#+RESULTS:

** pulsar
:PROPERTIES:
:ID:       364ad49b-e409-4523-93d4-3b99b89e5e29
:END:
#+begin_src emacs-lisp
  (use-package pulsar
    :init
    (pulsar-global-mode t)
    (setq pulsar-pulse t)
    (setq pulsar-delay 0.055)
    (setq pulsar-iterations 10)
    (setq pulsar-face 'pulsar-magenta)
    (setq pulsar-highlight-face 'pulsar-yellow)
    (let ((map global-map))
      (define-key map (kbd "C-c h p") #'pulsar-pulse-line)
      (define-key map (kbd "C-c h h") #'pulsar-highlight-line))
    (add-hook 'next-error-hook #'pulsar-pulse-line)
    (add-hook 'imenu-after-jump-hook #'pulsar-recenter-top)
    (add-hook 'imenu-after-jump-hook #'pulsar-reveal-entry))
#+end_src

#+RESULTS:

** elpy
:PROPERTIES:
:ID:       bc2bcffb-2610-427f-805b-227326651fa5
:END:
#+begin_src emacs-lisp
  (use-package elpy
    :ensure t
    :init
    (elpy-enable))
#+end_src

#+RESULTS:

** minimap
:PROPERTIES:
:ID:       03e074c3-8991-43ce-a0a2-ce9fdf51353b
:END:
#+begin_src emacs-lisp
  (use-package minimap
    :init
    (setq minimap-window-location 'right)
    (global-set-key (kbd "C-c m") '(lambda () (interactive) (minimap-mode))))
#+end_src

#+RESULTS:

** unicode
:PROPERTIES:
:ID:       5bfa09ba-11a9-4ee0-a62a-f0886c9df1ba
:END:
#+begin_src emacs-lisp
  (use-package unicode-fonts
    :init
    (unicode-fonts-setup))
#+end_src

#+RESULTS:

** amx
:PROPERTIES:
:ID:       d3e6ebfc-a8eb-4692-bbf8-0cac04473cdc
:END:
#+begin_src emacs-lisp
  (use-package amx
    :init
    (amx-mode 1))
#+end_src

#+RESULTS:

** ido completing read
:PROPERTIES:
:ID:       21a3c662-b051-42fb-841d-59aab15db17c
:END:
#+begin_src emacs-lisp
  (use-package ido-completing-read+
    :init
    (ido-ubiquitous-mode 1))
#+end_src

#+RESULTS:

** lsp
:PROPERTIES:
:ID:       8e035d7e-6f53-4626-805d-ad01c71faeca
:END:
#+begin_src emacs-lisp
  (use-package lsp-mode
    :init
    (setq lsp-keymap-prefix "C-c l")
    :hook (
	   (python-mode . lsp-deferred)
	   (sh-mode . lsp-deferred)
	   (lsp-mode . lsp-enable-which-key-integration))
    :commands (lsp lsp-deferred))
  (use-package lsp-ui :commands lsp-ui-mode)
  (use-package lsp-treemacs :commands lsp-treemacs-errors-list)
#+end_src

#+RESULTS:

** elpher
:PROPERTIES:
:ID:       1f1b47fa-c116-4f27-854e-9e6400830ae3
:END:
#+begin_src emacs-lisp
  (use-package elpher)
#+end_src

#+RESULTS:

** elfeed
:PROPERTIES:
:ID:       a122c115-bba2-44cb-906d-53fdbe904822
:END:
#+begin_src emacs-lisp
  (use-package elfeed)
#+end_src

#+RESULTS:

** solaire
:PROPERTIES:
:ID:       a02f6f97-902c-42c5-9bef-4cf0d2c1e709
:END:
#+begin_src emacs-lisp
  (use-package solaire-mode
    :init
    (solaire-global-mode +1))
#+end_src

#+RESULTS:

** indent guide
:PROPERTIES:
:ID:       5942044f-3d2a-4f0f-972d-4bdf6e65a4b9
:END:
#+begin_src emacs-lisp
  (use-package indent-guide
    :init
    (indent-guide-global-mode))
#+end_src

#+RESULTS:

** emamux 
:PROPERTIES:
:ID:       7ffd8d2e-cd03-4603-a63f-ebb8396d62f7
:END:
#+begin_src emacs-lisp
  (use-package emamux
    :bind
    ("C-c c" . emamux:send-region))
#+end_src

#+RESULTS:

** pdf
:PROPERTIES:
:ID:       ae50cb38-7206-4199-8725-c8c3bea5184b
:END:
#+begin_src emacs-lisp
  (use-package pdf-tools)
#+end_src

#+RESULTS:

** smartparens
:PROPERTIES:
:ID:       43c79c53-ddc3-4193-a8a4-6d74e54f198b
:END:
#+begin_src emacs-lisp
  (use-package smartparens
    :init
    (smartparens-global-mode +1))
#+end_src

#+RESULTS:

** modern  
:PROPERTIES:
:ID:       e8321d05-41b2-412d-b850-4fe1474e1a1b
:END:
#+begin_src emacs-lisp
  (use-package org-modern
    :hook (org-mode . org-modern-mode)
    :init
    (setq org-modern-label-border 'auto
	  org-modern-star nil
	  org-modern-hide-star nil
	  org-modern-block-name nil
	  org-modern-keyword nil
	  org-modern-timestamp t
	  org-modern-checkbox nil))
#+end_src

#+RESULTS:

** TODO xonsh
:PROPERTIES:
:ID:       ada127b3-e31e-46ee-9277-c386bb564d89
:END:
#+begin_src emacs-lisp
  ;; (defun org-babel-execute:xonsh (body params)
  ;;   (let ((in-file (org-babel-temp-file "xonsh-")))
  ;;    (with-temp-file in-file
  ;;       (insert body))
  ;;     (org-babel-eval
  ;;      (format "echo -e $($HOME/.pyenv/versions/3.11.4/bin/xonsh -c $(cat %s | sed \"s/^[[:space:]]*//g\"  | awk \"{print $1}\")) | sed \"s/\x1b\\[38;5;241m//g\" | sed \"s/\x1b\\[39m//g\" | sed -z \"/\n/d\" "
  ;;        (org-babel-process-file-name in-file))
  ;;      "")))))
  (use-package xonsh-mode)
#+end_src

#+RESULTS:
: org-babel-execute:xonsh

** brain
:PROPERTIES:
:ID:       da14fc89-2715-464b-990c-d82d379a5d6c
:END:
#+begin_src emacs-lisp
  (use-package org-brain :ensure t
    :init
    (setq org-brain-path "~/.voi.d/org/brain")
    (bind-key "C-c b" 'org-brain-prefix-map org-mode-map)
    (setq org-id-track-globally t)
    (setq org-id-locations-file "~/.voi.d/org/brain/ids/.org-id-locations")
    (add-hook 'before-save-hook #'org-brain-ensure-ids-in-buffer)
    (add-hook 'org-brain-visualize-mode-hook #'org-mode)
    (display-line-numbers-mode 0)
    (setq org-brain-visualize-default-choices 'all)
    (setq org-brain-title-max-length 12)
    (setq org-brain-include-file-entries t
	  org-brain-file-entries-use-title nil))
#+end_src

#+RESULTS:

** pyenv
:PROPERTIES:
:ID:       48c0c967-56cd-4cf7-bfd7-10beb6b1f872
:END:
#+begin_src emacs-lisp
  (use-package pyenv-mode
    :init
    (pyenv-mode))
#+end_src

#+RESULTS:

** eshell 
:PROPERTIES:
:ID:       458c1b99-71e1-4431-9fed-a7ecffb31f2f
:END:
#+begin_src emacs-lisp
  (add-hook 'eshell-mode-hook 'my-inhibit-global-linum-mode)
#+end_src

#+RESULTS:
| my-inhibit-global-linum-mode |

** term
:PROPERTIES:
:ID:       4f15feed-3d6f-4e17-a5fe-7246a11956a1
:END:
#+begin_src emacs-lisp
  (add-hook 'term-mode-hook 'my-inhibit-global-linum-mode)

  (defun my-inhibit-global-linum-mode ()
    (add-hook 'after-change-major-mode-hook
	      (lambda () (display-line-numbers-mode 0))
	      :append :local))
#+end_src

#+RESULTS:
: my-inhibit-global-linum-mode

