org/brain/config.el

(use-package undo-tree
  :init
  (global-undo-tree-mode))
(with-eval-after-load 'undo-tree
  (setq undo-tree-auto-save-history nil))

(use-package smart-mode-line-atom-one-dark-theme)
(use-package smart-mode-line
  :init
  (setq sml/no-confirm-load-theme t)
  (setq sml/theme 'atom-one-dark)
  (sml/setup))
(use-package doom-modeline
  :ensure t
  :init 
  (doom-modeline-mode 1))

(use-package deft
  :bind ("<f8>" . deft)
  :commands (deft)
  :config (setq deft-directory "~/notes"
		deft-extensions '("md" "org")
		deft-recursive t
		deft-use-filename-as-title t))

(use-package emojify
  :hook (after-init . global-emojify-mode))

(use-package beacon
  :init
  (beacon-mode 1))

(use-package hl-todo
  :init
  (global-hl-todo-mode))

(use-package diff-hl
  :ensure t
  :config
  (global-diff-hl-mode +1)
  (add-hook 'dired-mode-hook 'diff-hl-dired-mode)
  (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh))

(use-package flycheck
  :ensure t
  :init (global-flycheck-mode))

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  (global-set-key (kbd "C-c d") '(lambda () (interactive) (dashboard-open)))
  (setq dashboard-banner-logo-title "")
  (setq dashboard-center-content t)
  (setq dashboard-show-shortcuts nil)
  (setq dashboard-items '((recents  . 5)
			  (bookmarks . 5)
			  (projects . 5)
			  (agenda . 5)))
  (setq dashboard-display-icons-p t)
  (setq dashboard-icon-type 'nerd-icons)
  (setq dashboard-startup-banner '("~/.voi.d/banners/blackhole-lines.svg" . "~/.voi.d/banners/blackhole-lines.txt"))
  (setq dashboard-item-names '(("Recent Files:" . "  RECENT")
			       ("Bookmarks:" . "  BOOKMARKS")
			       ("Projects:" . "  PROJECTS")
			       ("Agenda for the coming week:" . "  AGENDA")))
  (setq dashboard-footer-messages '(
				    "voidmacs"
				    ))
  (setq dashboard-projects-switch-function 'projectile-persp-switch-project))
  ;; (setq dashboard-set-navigator t)
  ;; (setq dashboard-navigator-buttons
  ;; 	`(

  ;; 	  ((,(all-the-icons-octicon "mark-github" :height 1.1 :v-adjust 0.0)
  ;; 	    "Homepage"
  ;; 	    "Browse homepage"
  ;; 	    (lambda (&rest _) (browse-url "homepage")))
  ;; 	   ("★" "Star" "Show stars" (lambda (&rest _) (show-stars)) warning)
  ;; 	   ("?" "" "?/h" #'show-help nil "<" ">"))

  ;; 	  ((,(all-the-icons-faicon "linkedin" :height 1.1 :v-adjust 0.0)
  ;; 	    "Linkedin"
  ;; 	    ""
  ;; 	    (lambda (&rest _) (browse-url "homepage")))
  ;; 	   ("⚑" nil "Show flags" (lambda (&rest _) (message "flag")) error)))))

(use-package ace-popup-menu
  :init
  (ace-popup-menu-mode 1))

(use-package pulsar
  :init
  (pulsar-global-mode t)
  (setq pulsar-pulse t)
  (setq pulsar-delay 0.055)
  (setq pulsar-iterations 10)
  (setq pulsar-face 'pulsar-magenta)
  (setq pulsar-highlight-face 'pulsar-yellow)
  (let ((map global-map))
    (define-key map (kbd "C-c h p") #'pulsar-pulse-line)
    (define-key map (kbd "C-c h h") #'pulsar-highlight-line))
  (add-hook 'next-error-hook #'pulsar-pulse-line)
  (add-hook 'imenu-after-jump-hook #'pulsar-recenter-top)
  (add-hook 'imenu-after-jump-hook #'pulsar-reveal-entry))

(use-package elpy
  :ensure t
  :init
  (elpy-enable))

(use-package minimap
  :init
  (setq minimap-window-location 'right)
  (global-set-key (kbd "C-c m") '(lambda () (interactive) (minimap-mode))))

(use-package unicode-fonts
  :init
  (unicode-fonts-setup))

(use-package amx
  :init
  (amx-mode 1))

(use-package ido-completing-read+
  :init
  (ido-ubiquitous-mode 1))

(use-package lsp-mode
  :init
  (setq lsp-keymap-prefix "C-c l")
  :hook (
	 (python-mode . lsp-deferred)
	 (sh-mode . lsp-deferred)
	 (lsp-mode . lsp-enable-which-key-integration))
  :commands (lsp lsp-deferred))
(use-package lsp-ui :commands lsp-ui-mode)
(use-package lsp-treemacs :commands lsp-treemacs-errors-list)

(use-package elpher)

(use-package elfeed)

(use-package solaire-mode
  :init
  (solaire-global-mode +1))

(use-package indent-guide
  :init
  (indent-guide-global-mode))

(use-package emamux
  :bind
  ("C-c c" . emamux:send-region))

(use-package pdf-tools)

(use-package smartparens
  :init
  (smartparens-global-mode +1))

(use-package org-modern
  :hook (org-mode . org-modern-mode)
  :init
  (setq org-modern-label-border 'auto
	org-modern-star nil
	org-modern-hide-star nil
	org-modern-block-name nil
	org-modern-keyword nil
	org-modern-timestamp t
	org-modern-checkbox nil))

;; (defun org-babel-execute:xonsh (body params)
;;   (let ((in-file (org-babel-temp-file "xonsh-")))
;;    (with-temp-file in-file
;;       (insert body))
;;     (org-babel-eval
;;      (format "echo -e $($HOME/.pyenv/versions/3.11.4/bin/xonsh -c $(cat %s | sed \"s/^[[:space:]]*//g\"  | awk \"{print $1}\")) | sed \"s/\x1b\\[38;5;241m//g\" | sed \"s/\x1b\\[39m//g\" | sed -z \"/\n/d\" "
;;        (org-babel-process-file-name in-file))
;;      "")))))
(use-package xonsh-mode)

(use-package org-brain :ensure t
  :init
  (setq org-brain-path "~/.voi.d/org/brain")
  (bind-key "C-c b" 'org-brain-prefix-map org-mode-map)
  (setq org-id-track-globally t)
  (setq org-id-locations-file "~/.voi.d/org/brain/ids/.org-id-locations")
  (add-hook 'before-save-hook #'org-brain-ensure-ids-in-buffer)
  (add-hook 'org-brain-visualize-mode-hook #'org-mode)
  (display-line-numbers-mode 0)
  (setq org-brain-visualize-default-choices 'all)
  (setq org-brain-title-max-length 12)
  (setq org-brain-include-file-entries t
	org-brain-file-entries-use-title nil))

(use-package pyenv-mode
  :init
  (pyenv-mode))

(add-hook 'eshell-mode-hook 'my-inhibit-global-linum-mode)

(add-hook 'term-mode-hook 'my-inhibit-global-linum-mode)

(defun my-inhibit-global-linum-mode ()
  (add-hook 'after-change-major-mode-hook
	    (lambda () (display-line-numbers-mode 0))
	    :append :local))
