org/brain/config.org
** workgroups
:PROPERTIES:
:ID:       5ade54f4-29e4-47bc-a329-360945645f53
:END:
#+begin_src emacs-lisp
  (use-package workgroups2
    :init 
    (workgroups-mode 1)
    (setq wg-session-file "~/.voi.d/.emacs_workgroups")
    :bind
    ("C-c z" . wg-prefix-key))  
#+end_src

#+RESULTS:

** origami
:PROPERTIES:
:ID:       f19b3db9-49d9-441a-8ab5-b5d333249f1f
:END:
#+begin_src emacs-lisp
  (use-package origami
    :init
    (global-origami-mode 1)
    :bind
    ("C-<tab>" . origami-recursively-toggle-node))
#+end_src

#+RESULTS:

** hl defined
:PROPERTIES:
:ID:       e12d044e-4a13-4186-b4ad-cd9976a8b881
:END:
#+begin_src emacs-lisp
  (use-package highlight-defined
  :init
  (add-hook 'emacs-lisp-mode-hook 'highlight-defined-mode)
  (add-hook 'org-mode-hook 'highlight-defined-mode))
#+end_src

#+RESULTS:

** elmacro
:PROPERTIES:
:ID:       4c7b06d9-f72a-4438-a886-6eb0ccbfd586
:END:
#+begin_src emacs-lisp
  (use-package elmacro
    :init
    (elmacro-mode))
#+end_src

#+RESULTS:

** eros
:PROPERTIES:
:ID:       cdfe2c0a-f5d6-4671-9c3e-c850540f3133
:END:
#+begin_src emacs-lisp
  (use-package eros
    :init
    (eros-mode 1))
#+end_src

#+RESULTS:

* bindings
:PROPERTIES:
:ID:       2df62463-b697-473d-9510-3e38ac30bb19
:END:
#+begin_src emacs-lisp
  (windmove-default-keybindings)
  (setq tab-always-indent 'complete)
  (global-set-key (kbd "C-c t") '(lambda () (interactive) (eshell)))
  (global-set-key (kbd "C-c f") '(lambda () (interactive) (find-file "~/.voi.d/org/brain/config.org")))
  (global-set-key (kbd "C-c x") '(lambda () (interactive) (find-file "~/.voi.d/org/brain/xonsh.org")))
  (global-set-key (kbd "C-c s") '(lambda () (interactive) (find-file "~/.voi.d/org/brain/bash.org")))
  (global-set-key (kbd "C-c i") '(lambda () (interactive) (find-file "~/.voi.d/org/brain/init.org")))
  (global-set-key (kbd "C-x a") '(lambda () (interactive) (insert-timestamp)))
  (global-set-key (kbd "C-x C-l") '(lambda () (interactive) (org-toggle-timestamp-type)))
  (global-set-key (kbd "C-x s") '(lambda () (interactive) (save-buffer)))
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (save-buffer) |

* fonts
:PROPERTIES:
:ID:       2235f497-9773-4d7a-a15e-6be1cc751f7e
:END:
#+begin_src emacs-lisp
  (set-face-attribute 'default t
		      :font "Fira Code"
		      :height 110
		      :weight 'medium)
  (set-face-attribute 'variable-pitch t
		      :font "Lato"
		      :height 110
		      :weight 'medium)
  (set-face-attribute 'fixed-pitch t
		      :font "JetBrains Mono"
		      :height 110
		      :weight 'medium)
  (set-face-attribute 'font-lock-comment-face t
		      :slant 'italic)
  (set-face-attribute 'font-lock-keyword-face t
		      :slant 'italic)

  (add-to-list 'default-frame-alist '(font . "JetBrains Mono-11"))

  (setq-default line-spacing 0.12)
#+end_src

#+RESULTS:
: 0.12

* org
:PROPERTIES:
:ID:       6b6d8382-ecc4-40f1-8bee-c0dad5789073
:END:
#+begin_src emacs-lisp
  (setq org-directory "~/.voi.d/org/")
  (setq org-agenda-files (quote ("~/.voi.d/org/brain/agenda/")))
  (setq org-catch-invisible-edits 'show-and-error)
  (setq org-special-ctrl-a/e t)
  (setq org-insert-heading-respect-content t)
  (add-hook 'after-save-hook (lambda () (org-babel-tangle)))
  (org-babel-tangle-file "~/.voi.d/org/brain/xonsh.org")
  (org-babel-tangle-file "~/.voi.d/org/brain/bash.org")
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t)
     (shell . t)
     (lilypond . t)))
  (defun my-org-confirm-babel-evaluate (lang body)
    (not (member lang '("emacs-lisp" "python" "bash" "lilypond" "xonsh"))))
  (setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)
  (electric-indent-mode -1)
  (defun org-icons ()
    (setq prettify-symbols-alist '(("#+begin_src" . "❱")
				   ("#+end_src" . "❰")
				   ("#+RESULTS:" . "∴")
				   ("#+begin_example" . "⋉")
				   ("#+end_example" . "⋊")
				   (":PROPERTIES:" . "")
				   (":ID:" . "") ;; ??
				   (":END:" . "―")
				   ("#+startup:" . "")
				   ("#+title:" . "")
				   ("#+author:" . "")
				   ("#+header:" . "")
				   ("#+name:" . "")
				   ("#+filetags:" . "")
				   ("#+description:" . "")
				   ("#+subtitle:" . "⛛")
				   ("#+options:" . "⚒")
				   ("[ ]" . "")
				   ("[X]" . "")
				   ("[-]" . ""))))
  (add-hook 'org-mode-hook 'org-icons)
#+end_src

#+RESULTS:
| highlight-defined-mode | org-modern-mode | elpher-org-mode-integration | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | (closure (t) nil (org-bullets-mode 1)) | toc-org-enable | org-icons | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

* gui
:PROPERTIES:
:ID:       eadb255d-5091-43c9-981b-36b4fcb59b81
:END:
#+begin_src emacs-lisp
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (column-number-mode t)
  (size-indication-mode t)
  (global-display-line-numbers-mode 0)
  (global-visual-line-mode t)
  (global-prettify-symbols-mode t)
#+end_src

#+RESULTS:
: t

* footer
:PROPERTIES:
:ID:       6582c00b-9624-4e22-b0ed-ddf1d9e637cd
:END:
#+begin_src emacs-lisp
  (provide 'config)
  ;;; init.el ends here
#+end_src

#+RESULTS:
: config
