org/brain/config.el

(use-package workgroups2
  :init 
  (workgroups-mode 1)
  (setq wg-session-file "~/.voi.d/.emacs_workgroups")
  :bind
  ("C-c z" . wg-prefix-key))

(use-package origami
  :init
  (global-origami-mode 1)
  :bind
  ("C-<tab>" . origami-recursively-toggle-node))

(use-package highlight-defined
:init
(add-hook 'emacs-lisp-mode-hook 'highlight-defined-mode)
(add-hook 'org-mode-hook 'highlight-defined-mode))

(use-package elmacro
  :init
  (elmacro-mode))

(use-package eros
  :init
  (eros-mode 1))

(windmove-default-keybindings)
(setq tab-always-indent 'complete)
(global-set-key (kbd "C-c t") '(lambda () (interactive) (eshell)))
(global-set-key (kbd "C-c f") '(lambda () (interactive) (find-file "~/.voi.d/org/brain/config.org")))
(global-set-key (kbd "C-c x") '(lambda () (interactive) (find-file "~/.voi.d/org/brain/xonsh.org")))
(global-set-key (kbd "C-c s") '(lambda () (interactive) (find-file "~/.voi.d/org/brain/bash.org")))
(global-set-key (kbd "C-c i") '(lambda () (interactive) (find-file "~/.voi.d/org/brain/init.org")))
(global-set-key (kbd "C-x a") '(lambda () (interactive) (insert-timestamp)))
(global-set-key (kbd "C-x C-l") '(lambda () (interactive) (org-toggle-timestamp-type)))
(global-set-key (kbd "C-x s") '(lambda () (interactive) (save-buffer)))

(set-face-attribute 'default t
		    :font "Fira Code"
		    :height 110
		    :weight 'medium)
(set-face-attribute 'variable-pitch t
		    :font "Lato"
		    :height 110
		    :weight 'medium)
(set-face-attribute 'fixed-pitch t
		    :font "JetBrains Mono"
		    :height 110
		    :weight 'medium)
(set-face-attribute 'font-lock-comment-face t
		    :slant 'italic)
(set-face-attribute 'font-lock-keyword-face t
		    :slant 'italic)

(add-to-list 'default-frame-alist '(font . "JetBrains Mono-11"))

(setq-default line-spacing 0.12)

(setq org-directory "~/.voi.d/org/")
(setq org-agenda-files (quote ("~/.voi.d/org/brain/agenda/")))
(setq org-catch-invisible-edits 'show-and-error)
(setq org-special-ctrl-a/e t)
(setq org-insert-heading-respect-content t)
(add-hook 'after-save-hook (lambda () (org-babel-tangle)))
(org-babel-tangle-file "~/.voi.d/org/brain/xonsh.org")
(org-babel-tangle-file "~/.voi.d/org/brain/bash.org")
(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)
   (shell . t)
   (lilypond . t)))
(defun my-org-confirm-babel-evaluate (lang body)
  (not (member lang '("emacs-lisp" "python" "bash" "lilypond" "xonsh"))))
(setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)
(electric-indent-mode -1)
(defun org-icons ()
  (setq prettify-symbols-alist '(("#+begin_src" . "❱")
				 ("#+end_src" . "❰")
				 ("#+RESULTS:" . "∴")
				 ("#+begin_example" . "⋉")
				 ("#+end_example" . "⋊")
				 (":PROPERTIES:" . "")
				 (":ID:" . "") ;; ??
				 (":END:" . "―")
				 ("#+startup:" . "")
				 ("#+title:" . "")
				 ("#+author:" . "")
				 ("#+header:" . "")
				 ("#+name:" . "")
				 ("#+filetags:" . "")
				 ("#+description:" . "")
				 ("#+subtitle:" . "⛛")
				 ("#+options:" . "⚒")
				 ("[ ]" . "")
				 ("[X]" . "")
				 ("[-]" . ""))))
(add-hook 'org-mode-hook 'org-icons)

(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(column-number-mode t)
(size-indication-mode t)
(global-display-line-numbers-mode 0)
(global-visual-line-mode t)
(global-prettify-symbols-mode t)

(provide 'config)
;;; init.el ends here
